{
  "basics": {
    "label": "Lead Backend Software Developer | Python, Microservices, Cloud Architect",
    "email": "that@teagantotally.rocks",
    "phone": "(720) 432-5361",
    "website": "https://blog.teagantotally.rocks",
    "name": "Teagan Glenn",
    "summary": "Expert Backend Software Developer with over 20 years of experience in designing, developing, and deploying scalable backend systems. Proven track record in creating robust APIs and microservices architecture, with deep expertise in Python, Flask, Django, and cloud platforms like Google Cloud Platform (GCP). Skilled in developing backend architecture, session management, authentication, and scaling systems with a focus on security and reliability. I thrive in collaborative environments, driving technical direction, and solving complex challenges through empathy and innovation.",
    "picture": "teagan-memoji-computer.png",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Teagan42",
        "url": "https://www.linkedin.com/in/teagan42"
      },
      {
        "network": "GitHub",
        "username": "Teagan42",
        "url": "https://www.github.com/teagan42"
      }
    ]
  },
  "work": [
    {
      "company": "Resideo",
      "website": "https://www.resideo.com",
      "position": "Advanced Senior GraphQL Lead Engineer",
      "startDate": "2022-05-01",
      "endDate": "2024-06-28",
      "highlights": [
        "Led backend development initiatives, improving the architecture of a widely used platform with focus on GraphQL.",
        "Implemented microservices and scalable architecture using Docker and Kubernetes, improving the platform's resilience and scalability.",
        "Guided cross-functional teams on implementing secure and testable backend systems.",
        "Migrated critical components from monolithic to microservices architecture."
      ]
    },
    {
      "company": "World Wide Technology",
      "website": "https://www.wwt.com",
      "position": "Senior Delivery Engineer",
      "startDate": "2021-01-01",
      "endDate": "2022-05-01",
      "highlights": [
        "Developed and deployed REST APIs and backend services using Python, enhancing system interoperability.",
        "Architected a solution that integrated cloud platforms with on-premise services for large-scale data management.",
        "Led the development of containerized applications using Docker and Kubernetes.",
        "Deployed services on Google Cloud Platform (GCP) ensuring scalability and reliability."
      ]
    },
    {
      "company": "Turnberry Solutions",
      "website": "https://www.turnberrysolutions.com",
      "position": "Senior Automation Engineer for Comcast Applied AI",
      "startDate": "2019-05-01",
      "endDate": "2020-09-14",
      "highlights": [
        "Developed REST APIs and backend microservices using Python, Flask, and SQL databases.",
        "Designed and deployed containerized environments using Docker and Kubernetes on Google Cloud Platform.",
        "Created infrastructure automation solutions using Ansible, improving deployment efficiency.",
        "Integrated NoSQL databases like MongoDB into backend services for real-time data handling."
      ]
    }
  ],
  "education": [
    {
      "institution": "Metropolitan State University of Denver - Bachelor's in Physics",
      "startDate": "2005-08-01",
      "endDate": "2010-04-01",
      "area": "Computer Science",
      "studyType": "Bachelor's"
    },
    {
      "institution": "Metropolitan State University of Denver - Bachelor's in Mathematics",
      "startDate": "2005-08-01",
      "endDate": "2010-04-01",
      "area": "Computer Science",
      "studyType": "Bachelor's"
    },
    {
      "institution": "Metropolitan State University of Denver - Bachelor's in Computer Science",
      "startDate": "2005-08-01",
      "endDate": "2010-04-01",
      "area": "Computer Science",
      "studyType": "Bachelor's"
    }
  ],
  "skills": [
    {
      "name": "Backend Development",
      "keywords": [
        "Python",
        "Flask",
        "Django",
        "REST API Development",
        "MySQL",
        "PostgreSQL"
      ]
    },
    {
      "name": "Cloud & DevOps",
      "keywords": [
        "Docker",
        "Kubernetes",
        "Microservices",
        "DevOps",
        "CI/CD"
      ]
    },
    {
      "name": "Tools & Automation",
      "keywords": [
        "Docker",
        "Kubernetes",
        "E2E Testing",
        "Unit Testing"
      ]
    },
    {
      "name": "Soft",
      "keywords": [
        "Team Leadership",
        "Collaboration",
        "Problem-Solving"
      ]
    }
  ]
}